Israr-Engineering/PMM/custom_Board/1.8.13/boards.txt
# PMM0639 (ESI 4xAnalog Input Output + Digital Input Output)
# --------------------------------------
PMM0639.name=PMM0639 (ESI 4xAI + 4xAO + 2xDI + 2xDO)
PMM0639.vid.0=0x2341
PMM0639.pid.0=0x804d
PMM0639.vid.1=0x2341
PMM0639.pid.1=0x004d
PMM0639.vid.2=0x2341
PMM0639.pid.2=0x824d
PMM0639.vid.3=0x2341
PMM0639.pid.3=0x024d
PMM0639.upload_port.0.vid=0x2341
PMM0639.upload_port.0.pid=0x804d
PMM0639.upload_port.1.vid=0x2341
PMM0639.upload_port.1.pid=0x004d
PMM0639.upload_port.2.vid=0x2341
PMM0639.upload_port.2.pid=0x824d
PMM0639.upload_port.3.vid=0x2341
PMM0639.upload_port.3.pid=0x024d
PMM0639.upload_port.4.board=PMM0639
PMM0639.build.usb_product="PMM0639"
PMM0639.upload.tool=bossac
PMM0639.upload.tool.default=bossac
PMM0639.upload.tool.network=arduino_ota
PMM0639.upload.protocol=sam-ba
PMM0639.upload.maximum_size=262144
PMM0639.upload.maximum_data_size=32768
PMM0639.upload.use_1200bps_touch=true
PMM0639.upload.wait_for_upload_port=true
PMM0639.upload.native_usb=true
PMM0639.build.mcu=cortex-m0plus
PMM0639.build.f_cpu=48000000L
PMM0639.build.usb_manufacturer="PMM LLC"
PMM0639.build.board=pmm0639
PMM0639.build.core=arduino
PMM0639.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0639.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0639.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0639.build.variant=pmm062x
PMM0639.build.variant_system_lib=
PMM0639.build.vid=0x2341
PMM0639.build.pid=0x804d
PMM0639.bootloader.tool=openocd
PMM0639.bootloader.tool.default=openocd
PMM0639.bootloader.file=zero/samd21_sam_ba.bin

# Extension Boards
# PMM0620X (SI 16x Digital Inputs)
# --------------------------------------
PMM0620X.name=PMM0620X (SI 16xDI)
PMM0620X.vid.0=0x2341
PMM0620X.pid.0=0x804d
PMM0620X.vid.1=0x2341
PMM0620X.pid.1=0x004d
PMM0620X.vid.2=0x2341
PMM0620X.pid.2=0x824d
PMM0620X.vid.3=0x2341
PMM0620X.pid.3=0x024d
PMM0620X.upload_port.0.vid=0x2341
PMM0620X.upload_port.0.pid=0x804d
PMM0620X.upload_port.1.vid=0x2341
PMM0620X.upload_port.1.pid=0x004d
PMM0620X.upload_port.2.vid=0x2341
PMM0620X.upload_port.2.pid=0x824d
PMM0620X.upload_port.3.vid=0x2341
PMM0620X.upload_port.3.pid=0x024d
PMM0620X.upload_port.4.board=PMM0620X
PMM0620X.build.usb_product="PMM0620X"
PMM0620X.upload.tool=bossac
PMM0620X.upload.tool.default=bossac
PMM0620X.upload.tool.network=arduino_ota
PMM0620X.upload.protocol=sam-ba
PMM0620X.upload.maximum_size=262144
PMM0620X.upload.maximum_data_size=32768
PMM0620X.upload.use_1200bps_touch=true
PMM0620X.upload.wait_for_upload_port=true
PMM0620X.upload.native_usb=true
PMM0620X.build.mcu=cortex-m0plus
PMM0620X.build.f_cpu=48000000L
PMM0620X.build.usb_product="pmm0620X"
PMM0620X.build.usb_manufacturer="PMM LLC"
PMM0620X.build.board=pmm0620X
PMM0620X.build.core=arduino
PMM0620X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0620X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0620X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0620X.build.variant=pmm062X
PMM0620X.build.variant_system_lib=
PMM0620X.build.vid=0x2341
PMM0620X.build.pid=0x804d
PMM0620X.bootloader.tool=openocd
PMM0620X.bootloader.tool.default=openocd
PMM0620X.bootloader.file=zero/samd21_sam_ba.bin


# PMM0625X (SI 16x Digital Inputs T)
# --------------------------------------
PMM0625X.name=PMM0625X (SI 16xDO T)
PMM0625X.vid.0=0x2341
PMM0625X.pid.0=0x804d
PMM0625X.vid.1=0x2341
PMM0625X.pid.1=0x004d
PMM0625X.vid.2=0x2341
PMM0625X.pid.2=0x824d
PMM0625X.vid.3=0x2341
PMM0625X.pid.3=0x024d
PMM0625X.upload_port.0.vid=0x2341
PMM0625X.upload_port.0.pid=0x804d
PMM0625X.upload_port.1.vid=0x2341
PMM0625X.upload_port.1.pid=0x004d
PMM0625X.upload_port.2.vid=0x2341
PMM0625X.upload_port.2.pid=0x824d
PMM0625X.upload_port.3.vid=0x2341
PMM0625X.upload_port.3.pid=0x024d
PMM0625X.upload_port.4.board=PMM0625X
PMM0625X.build.usb_product="PMM0625X"
PMM0625X.upload.tool=bossac
PMM0625X.upload.tool.default=bossac
PMM0625X.upload.tool.network=arduino_ota
PMM0625X.upload.protocol=sam-ba
PMM0625X.upload.maximum_size=262144
PMM0625X.upload.maximum_data_size=32768
PMM0625X.upload.use_1200bps_touch=true
PMM0625X.upload.wait_for_upload_port=true
PMM0625X.upload.native_usb=true
PMM0625X.build.mcu=cortex-m0plus
PMM0625X.build.f_cpu=48000000L
PMM0625X.build.usb_product="pmm0625X"
PMM0625X.build.usb_manufacturer="PMM LLC"
PMM0625X.build.board=pmm0625X
PMM0625X.build.core=arduino
PMM0625X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0625X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0625X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0625X.build.variant=pmm062X
PMM0625X.build.variant_system_lib=
PMM0625X.build.vid=0x2341
PMM0625X.build.pid=0x804d
PMM0625X.bootloader.tool=openocd
PMM0625X.bootloader.tool.default=openocd
PMM0625X.bootloader.file=zero/samd21_sam_ba.bin


# PMM0626X (SI 16x Digital Output R)
# -------------------------------------
PMM0626X.name=PMM0626X (SI 16xDO R)
PMM0626X.vid.0=0x2341
PMM0626X.pid.0=0x804d
PMM0626X.vid.1=0x2341
PMM0626X.pid.1=0x004d
PMM0626X.vid.2=0x2341
PMM0626X.pid.2=0x824d
PMM0626X.vid.3=0x2341
PMM0626X.pid.3=0x024d
PMM0626X.upload_port.0.vid=0x2341
PMM0626X.upload_port.0.pid=0x804d
PMM0626X.upload_port.1.vid=0x2341
PMM0626X.upload_port.1.pid=0x004d
PMM0626X.upload_port.2.vid=0x2341
PMM0626X.upload_port.2.pid=0x824d
PMM0626X.upload_port.3.vid=0x2341
PMM0626X.upload_port.3.pid=0x024d
PMM0626X.upload_port.4.board=PMM0626X
PMM0626X.build.usb_product="PMM0626X"
PMM0626X.upload.tool=bossac
PMM0626X.upload.tool.default=bossac
PMM0626X.upload.tool.network=arduino_ota
PMM0626X.upload.protocol=sam-ba
PMM0626X.upload.maximum_size=262144
PMM0626X.upload.maximum_data_size=32768
PMM0626X.upload.use_1200bps_touch=true
PMM0626X.upload.wait_for_upload_port=true
PMM0626X.upload.native_usb=true
PMM0626X.build.mcu=cortex-m0plus
PMM0626X.build.f_cpu=48000000L
PMM0626X.build.usb_product="pmm0626X"
PMM0626X.build.usb_manufacturer="PMM LLC"
PMM0626X.build.board=pmm0626X
PMM0626X.build.core=arduino
PMM0626X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0626X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0626X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0626X.build.variant=pmm062X
PMM0626X.build.variant_system_lib=
PMM0626X.build.vid=0x2341
PMM0626X.build.pid=0x804d
PMM0626X.bootloader.tool=openocd
PMM0626X.bootloader.tool.default=openocd
PMM0626X.bootloader.file=zero/samd21_sam_ba.bin



# PMM0628RX (SI 12x Digital Inputs 6x Digital Outputs)
# -------------------------------------
PMM0628RX.name=PMM0628RX (SI 12xDI + 6xDO)
PMM0628RX.vid.0=0x2341
PMM0628RX.pid.0=0x804d
PMM0628RX.vid.1=0x2341
PMM0628RX.pid.1=0x004d
PMM0628RX.vid.2=0x2341
PMM0628RX.pid.2=0x824d
PMM0628RX.vid.3=0x2341
PMM0628RX.pid.3=0x024d
PMM0628RX.upload_port.0.vid=0x2341
PMM0628RX.upload_port.0.pid=0x804d
PMM0628RX.upload_port.1.vid=0x2341
PMM0628RX.upload_port.1.pid=0x004d
PMM0628RX.upload_port.2.vid=0x2341
PMM0628RX.upload_port.2.pid=0x824d
PMM0628RX.upload_port.3.vid=0x2341
PMM0628RX.upload_port.3.pid=0x024d
PMM0628RX.upload_port.4.board=PMM0628RX
PMM0628RX.build.usb_product="PMM0628RX"
PMM0628RX.upload.tool=bossac
PMM0628RX.upload.tool.default=bossac
PMM0628RX.upload.tool.network=arduino_ota
PMM0628RX.upload.protocol=sam-ba
PMM0628RX.upload.maximum_size=262144
PMM0628RX.upload.maximum_data_size=32768
PMM0628RX.upload.use_1200bps_touch=true
PMM0628RX.upload.wait_for_upload_port=true
PMM0628RX.upload.native_usb=true
PMM0628RX.build.mcu=cortex-m0plus
PMM0628RX.build.f_cpu=48000000L
PMM0628RX.build.usb_product="pmm0628RX"
PMM0628RX.build.usb_manufacturer="PMM LLC"
PMM0628RX.build.board=pmm0628RX
PMM0628RX.build.core=arduino
PMM0628RX.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628RX.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628RX.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628RX.build.variant=pmm062X
PMM0628RX.build.variant_system_lib=
PMM0628RX.build.vid=0x2341
PMM0628RX.build.pid=0x804d
PMM0628RX.bootloader.tool=openocd
PMM0628RX.bootloader.tool.default=openocd
PMM0628RX.bootloader.file=zero/samd21_sam_ba.bin


# PMM0628TX (SI 12x Digital Inputs 6x Digital Outputs)
# -------------------------------------
PMM0628TX.name=PMM0628TX (SI 12xDI + 6xDO)
PMM0628TX.vid.0=0x2341
PMM0628TX.pid.0=0x804d
PMM0628TX.vid.1=0x2341
PMM0628TX.pid.1=0x004d
PMM0628TX.vid.2=0x2341
PMM0628TX.pid.2=0x824d
PMM0628TX.vid.3=0x2341
PMM0628TX.pid.3=0x024d
PMM0628TX.upload_port.0.vid=0x2341
PMM0628TX.upload_port.0.pid=0x804d
PMM0628TX.upload_port.1.vid=0x2341
PMM0628TX.upload_port.1.pid=0x004d
PMM0628TX.upload_port.2.vid=0x2341
PMM0628TX.upload_port.2.pid=0x824d
PMM0628TX.upload_port.3.vid=0x2341
PMM0628TX.upload_port.3.pid=0x024d
PMM0628TX.upload_port.4.board=PMM0628TX
PMM0628TX.build.usb_product="PMM0628TX"
PMM0628TX.upload.tool=bossac
PMM0628TX.upload.tool.default=bossac
PMM0628TX.upload.tool.network=arduino_ota
PMM0628TX.upload.protocol=sam-ba
PMM0628TX.upload.maximum_size=262144
PMM0628TX.upload.maximum_data_size=32768
PMM0628TX.upload.use_1200bps_touch=true
PMM0628TX.upload.wait_for_upload_port=true
PMM0628TX.upload.native_usb=true
PMM0628TX.build.mcu=cortex-m0plus
PMM0628TX.build.f_cpu=48000000L
PMM0628TX.build.usb_product="pmm0628TX"
PMM0628TX.build.usb_manufacturer="PMM LLC"
PMM0628TX.build.board=pmm0628TX
PMM0628TX.build.core=arduino
PMM0628TX.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628TX.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628TX.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628TX.build.variant=pmm062X
PMM0628TX.build.variant_system_lib=
PMM0628TX.build.vid=0x2341
PMM0628TX.build.pid=0x804d
PMM0628TX.bootloader.tool=openocd
PMM0628TX.bootloader.tool.default=openocd
PMM0628TX.bootloader.file=zero/samd21_sam_ba.bin

# PMM0632X (SI 16x Analog Inputs)
# --------------------------------------
PMM0632X.name=PMM0632X (SI 16xAI)
PMM0632X.vid.0=0x2341
PMM0632X.pid.0=0x804d
PMM0632X.vid.1=0x2341
PMM0632X.pid.1=0x004d
PMM0632X.vid.2=0x2341
PMM0632X.pid.2=0x824d
PMM0632X.vid.3=0x2341
PMM0632X.pid.3=0x024d
PMM0632X.upload_port.0.vid=0x2341
PMM0632X.upload_port.0.pid=0x804d
PMM0632X.upload_port.1.vid=0x2341
PMM0632X.upload_port.1.pid=0x004d
PMM0632X.upload_port.2.vid=0x2341
PMM0632X.upload_port.2.pid=0x824d
PMM0632X.upload_port.3.vid=0x2341
PMM0632X.upload_port.3.pid=0x024d
PMM0632X.upload_port.4.board=PMM0632X
PMM0632X.build.usb_product="PMM0632X"
PMM0632X.upload.tool=bossac
PMM0632X.upload.tool.default=bossac
PMM0632X.upload.tool.network=arduino_ota
PMM0632X.upload.protocol=sam-ba
PMM0632X.upload.maximum_size=32768
PMM0632X.upload.maximum_data_size=4096
PMM0632X.upload.use_1200bps_touch=true
PMM0632X.upload.wait_for_upload_port=true
PMM0632X.upload.native_usb=true
PMM0632X.build.mcu=cortex-m0plus
PMM0632X.build.f_cpu=48000000L
PMM0632X.build.usb_product="pmm0632X"
PMM0632X.build.usb_manufacturer="PMM LLC"
PMM0632X.build.board=pmm0632X
PMM0632X.build.core=arduino
PMM0632X.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
PMM0632X.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0632X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0632X.build.variant=pmm0615X
PMM0632X.build.variant_system_lib=
PMM0632X.build.vid=0x2341
PMM0632X.build.pid=0x804d
PMM0632X.bootloader.tool=openocd
PMM0632X.bootloader.tool.default=openocd
PMM0632X.bootloader.file=zero15b/samd21_sam_ba.bin

