Israr-Engineering/PMM/custom_Board/1.8.13/boards.txt
# PMM0632XP (SI 24x Analog Inputs)
# --------------------------------------
PMM0632XP.name=PMM0632XP (I 24xAI)
PMM0632XP.vid.0=0x2341
PMM0632XP.pid.0=0x804d
PMM0632XP.vid.1=0x2341
PMM0632XP.pid.1=0x004d
PMM0632XP.vid.2=0x2341
PMM0632XP.pid.2=0x824d
PMM0632XP.vid.3=0x2341
PMM0632XP.pid.3=0x024d
PMM0632XP.upload_port.0.vid=0x2341
PMM0632XP.upload_port.0.pid=0x804d
PMM0632XP.upload_port.1.vid=0x2341
PMM0632XP.upload_port.1.pid=0x004d
PMM0632XP.upload_port.2.vid=0x2341
PMM0632XP.upload_port.2.pid=0x824d
PMM0632XP.upload_port.3.vid=0x2341
PMM0632XP.upload_port.3.pid=0x024d
PMM0632XP.upload_port.4.board=PMM0632XP
PMM0632XP.build.usb_product="PMM0632XP"
PMM0632XP.upload.tool=bossac
PMM0632XP.upload.tool.default=bossac
PMM0632XP.upload.tool.network=arduino_ota
PMM0632XP.upload.protocol=sam-ba
PMM0632XP.upload.maximum_size=32768
PMM0632XP.upload.maximum_data_size=4096
PMM0632XP.upload.use_1200bps_touch=true
PMM0632XP.upload.wait_for_upload_port=true
PMM0632XP.upload.native_usb=true
PMM0632XP.build.mcu=cortex-m0plus
PMM0632XP.build.f_cpu=48000000L
PMM0632XP.build.usb_product="pmm0632XP"
PMM0632XP.build.usb_manufacturer="PMM LLC"
PMM0632XP.build.board=pmm0632XP
PMM0632XP.build.core=arduino
PMM0632XP.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
PMM0632XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0632XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0632XP.build.variant=pmm0615XP
PMM0632XP.build.variant_system_lib=
PMM0632XP.build.vid=0x2341
PMM0632XP.build.pid=0x804d
PMM0632XP.bootloader.tool=openocd
PMM0632XP.bootloader.tool.default=openocd
PMM0632XP.bootloader.file=zero15b/samd21_sam_ba.bin


# PMM0635XP (SI 24x Analog Outputs)
# --------------------------------------
PMM0635XP.name=PMM0635XP (I 24xAO)
PMM0635XP.vid.0=0x2341
PMM0635XP.pid.0=0x804d
PMM0635XP.vid.1=0x2341
PMM0635XP.pid.1=0x004d
PMM0635XP.vid.2=0x2341
PMM0635XP.pid.2=0x824d
PMM0635XP.vid.3=0x2341
PMM0635XP.pid.3=0x024d
PMM0635XP.upload_port.0.vid=0x2341
PMM0635XP.upload_port.0.pid=0x804d
PMM0635XP.upload_port.1.vid=0x2341
PMM0635XP.upload_port.1.pid=0x004d
PMM0635XP.upload_port.2.vid=0x2341
PMM0635XP.upload_port.2.pid=0x824d
PMM0635XP.upload_port.3.vid=0x2341
PMM0635XP.upload_port.3.pid=0x024d
PMM0635XP.upload_port.4.board=PMM0635XP
PMM0635XP.build.usb_product="PMM0635XP"
PMM0635XP.upload.tool=bossac
PMM0635XP.upload.tool.default=bossac
PMM0635XP.upload.tool.network=arduino_ota
PMM0635XP.upload.protocol=sam-ba
PMM0635XP.upload.maximum_size=32768
PMM0635XP.upload.maximum_data_size=4096
PMM0635XP.upload.use_1200bps_touch=true
PMM0635XP.upload.wait_for_upload_port=true
PMM0635XP.upload.native_usb=true
PMM0635XP.build.mcu=cortex-m0plus
PMM0635XP.build.f_cpu=48000000L
PMM0635XP.build.usb_product="pmm0635XP"
PMM0635XP.build.usb_manufacturer="PMM LLC"
PMM0635XP.build.board=pmm0635XP
PMM0635XP.build.core=arduino
PMM0635XP.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
PMM0635XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0635XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0635XP.build.variant=pmm0615XP
PMM0635XP.build.variant_system_lib=
PMM0635XP.build.vid=0x2341
PMM0635XP.build.pid=0x804d
PMM0635XP.bootloader.tool=openocd
PMM0635XP.bootloader.tool.default=openocd
PMM0635XP.bootloader.file=zero15b/samd21_sam_ba.bin


# PMM0638XP (SI 12 x Analog Inputs + 12 x Analog Outputs)
# --------------------------------------
PMM0638XP.name=PMM0638XP (I 12xAI + 12xAO)
PMM0638XP.vid.0=0x2341
PMM0638XP.pid.0=0x804d
PMM0638XP.vid.1=0x2341
PMM0638XP.pid.1=0x004d
PMM0638XP.vid.2=0x2341
PMM0638XP.pid.2=0x824d
PMM0638XP.vid.3=0x2341
PMM0638XP.pid.3=0x024d
PMM0638XP.upload_port.0.vid=0x2341
PMM0638XP.upload_port.0.pid=0x804d
PMM0638XP.upload_port.1.vid=0x2341
PMM0638XP.upload_port.1.pid=0x004d
PMM0638XP.upload_port.2.vid=0x2341
PMM0638XP.upload_port.2.pid=0x824d
PMM0638XP.upload_port.3.vid=0x2341
PMM0638XP.upload_port.3.pid=0x024d
PMM0638XP.upload_port.4.board=PMM0638XP
PMM0638XP.build.usb_product="PMM0638XP"
PMM0638XP.upload.tool=bossac
PMM0638XP.upload.tool.default=bossac
PMM0638XP.upload.tool.network=arduino_ota
PMM0638XP.upload.protocol=sam-ba
PMM0638XP.upload.maximum_size=32768
PMM0638XP.upload.maximum_data_size=4096
PMM0638XP.upload.use_1200bps_touch=true
PMM0638XP.upload.wait_for_upload_port=true
PMM0638XP.upload.native_usb=true
PMM0638XP.build.mcu=cortex-m0plus
PMM0638XP.build.f_cpu=48000000L
PMM0638XP.build.usb_product="pmm0638XP"
PMM0638XP.build.usb_manufacturer="PMM LLC"
PMM0638XP.build.board=pmm0638XP
PMM0638XP.build.core=arduino
PMM0638XP.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
PMM0638XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0638XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0638XP.build.variant=pmm0615XP
PMM0638XP.build.variant_system_lib=
PMM0638XP.build.vid=0x2341
PMM0638XP.build.pid=0x804d
PMM0638XP.bootloader.tool=openocd
PMM0638XP.bootloader.tool.default=openocd
PMM0638XP.bootloader.file=zero15b/samd21_sam_ba.bin


# PMM0639XP (SI 12x Digital Inputs + 6x Digital Outputs + 4x Analog Inputs + 2x Analog Outputs)
# --------------------------------------
PMM0639XP.name=PMM0639XP (I 12xDI + 6xDO + 4xAI + 2xAO)
PMM0639XP.vid.0=0x2341
PMM0639XP.pid.0=0x804d
PMM0639XP.vid.1=0x2341
PMM0639XP.pid.1=0x004d
PMM0639XP.vid.2=0x2341
PMM0639XP.pid.2=0x824d
PMM0639XP.vid.3=0x2341
PMM0639XP.pid.3=0x024d
PMM0639XP.upload_port.0.vid=0x2341
PMM0639XP.upload_port.0.pid=0x804d
PMM0639XP.upload_port.1.vid=0x2341
PMM0639XP.upload_port.1.pid=0x004d
PMM0639XP.upload_port.2.vid=0x2341
PMM0639XP.upload_port.2.pid=0x824d
PMM0639XP.upload_port.3.vid=0x2341
PMM0639XP.upload_port.3.pid=0x024d
PMM0639XP.upload_port.4.board=PMM0639XP
PMM0639XP.build.usb_product="PMM0639XP"
PMM0639XP.upload.tool=bossac
PMM0639XP.upload.tool.default=bossac
PMM0639XP.upload.tool.network=arduino_ota
PMM0639XP.upload.protocol=sam-ba
PMM0639XP.upload.maximum_size=32768
PMM0639XP.upload.maximum_data_size=4096
PMM0639XP.upload.use_1200bps_touch=true
PMM0639XP.upload.wait_for_upload_port=true
PMM0639XP.upload.native_usb=true
PMM0639XP.build.mcu=cortex-m0plus
PMM0639XP.build.f_cpu=48000000L
PMM0639XP.build.usb_product="pmm0639XP"
PMM0639XP.build.usb_manufacturer="PMM LLC"
PMM0639XP.build.board=pmm0639XP
PMM0639XP.build.core=arduino
PMM0639XP.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
PMM0639XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0639XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0639XP.build.variant=pmm0615XP
PMM0639XP.build.variant_system_lib=
PMM0639XP.build.vid=0x2341
PMM0639XP.build.pid=0x804d
PMM0639XP.bootloader.tool=openocd
PMM0639XP.bootloader.tool.default=openocd
PMM0639XP.bootloader.file=zero15b/samd21_sam_ba.bin

#Special porpuse


