Israr-Engineering/PMM/custom_Board/1.8.13/boards.txt
# PMM0606 (ESI High Speed Data Logger)
# --------------------------------------
PMM0606.name=PMM0606 (ESI HS DataLogger)
PMM0606.vid.0=0x2341
PMM0606.pid.0=0x804d
PMM0606.vid.1=0x2341
PMM0606.pid.1=0x004d
PMM0606.vid.2=0x2341
PMM0606.pid.2=0x824d
PMM0606.vid.3=0x2341
PMM0606.pid.3=0x024d
PMM0606.upload_port.0.vid=0x2341
PMM0606.upload_port.0.pid=0x804d
PMM0606.upload_port.1.vid=0x2341
PMM0606.upload_port.1.pid=0x004d
PMM0606.upload_port.2.vid=0x2341
PMM0606.upload_port.2.pid=0x824d
PMM0606.upload_port.3.vid=0x2341
PMM0606.upload_port.3.pid=0x024d
PMM0606.upload_port.4.board=PMM0606
PMM0606.build.usb_product="PMM0606"
PMM0606.upload.tool=bossac
PMM0606.upload.tool.default=bossac
PMM0606.upload.tool.network=arduino_ota
PMM0606.upload.protocol=sam-ba
PMM0606.upload.maximum_size=262144
PMM0606.upload.maximum_data_size=32768
PMM0606.upload.use_1200bps_touch=true
PMM0606.upload.wait_for_upload_port=true
PMM0606.upload.native_usb=true
PMM0606.build.mcu=cortex-m0plus
PMM0606.build.f_cpu=48000000L
PMM0606.build.usb_product="pmm0606"
PMM0606.build.usb_manufacturer="PMM LLC"
PMM0606.build.board=pmm0606
PMM0606.build.core=arduino
PMM0606.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0606.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0606.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0606.build.variant=pmm062X
PMM0606.build.variant_system_lib=
PMM0606.build.vid=0x2341
PMM0606.build.pid=0x804d
PMM0606.bootloader.tool=openocd
PMM0606.bootloader.tool.default=openocd
PMM0606.bootloader.file=zero/samd21_sam_ba.bin



# PMM0610 (ESI Base Blutooth and Ethernet)
# --------------------------------------
PMM0610.name=PMM0610 (ESI Wierless Base)
PMM0610.vid.0=0x2341
PMM0610.pid.0=0x804d
PMM0610.vid.1=0x2341
PMM0610.pid.1=0x004d
PMM0610.vid.2=0x2341
PMM0610.pid.2=0x824d
PMM0610.vid.3=0x2341
PMM0610.pid.3=0x024d
PMM0610.upload_port.0.vid=0x2341
PMM0610.upload_port.0.pid=0x804d
PMM0610.upload_port.1.vid=0x2341
PMM0610.upload_port.1.pid=0x004d
PMM0610.upload_port.2.vid=0x2341
PMM0610.upload_port.2.pid=0x824d
PMM0610.upload_port.3.vid=0x2341
PMM0610.upload_port.3.pid=0x024d
PMM0610.upload_port.4.board=PMM0610
PMM0610.build.usb_product="PMM0610"
PMM0610.upload.tool=bossac
PMM0610.upload.tool.default=bossac
PMM0610.upload.tool.network=arduino_ota
PMM0610.upload.protocol=sam-ba
PMM0610.upload.maximum_size=262144
PMM0610.upload.maximum_data_size=32768
PMM0610.upload.use_1200bps_touch=true
PMM0610.upload.wait_for_upload_port=true
PMM0610.upload.native_usb=true
PMM0610.build.mcu=cortex-m0plus
PMM0610.build.f_cpu=48000000L
PMM0610.build.usb_product="pmm0610"
PMM0610.build.usb_manufacturer="PMM LLC"
PMM0610.build.board=pmm0610
PMM0610.build.core=arduino
PMM0610.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0610.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0610.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0610.build.variant=pmm062X
PMM0610.build.variant_system_lib=
PMM0610.build.vid=0x2341
PMM0610.build.pid=0x804d
PMM0610.bootloader.tool=openocd
PMM0610.bootloader.tool.default=openocd
PMM0610.bootloader.file=zero/samd21_sam_ba.bin


#PMM0612 (ESI F.O SWITCH)
# --------------------------------------
PMM0612.name=PMM0612 (ESI F.O SWITCH)
PMM0612.vid.0=0x2341
PMM0612.pid.0=0x804d
PMM0612.vid.1=0x2341
PMM0612.pid.1=0x004d
PMM0612.vid.2=0x2341
PMM0612.pid.2=0x824d
PMM0612.vid.3=0x2341
PMM0612.pid.3=0x024d
PMM0612.upload_port.0.vid=0x2341
PMM0612.upload_port.0.pid=0x804d
PMM0612.upload_port.1.vid=0x2341
PMM0612.upload_port.1.pid=0x004d
PMM0612.upload_port.2.vid=0x2341
PMM0612.upload_port.2.pid=0x824d
PMM0612.upload_port.3.vid=0x2341
PMM0612.upload_port.3.pid=0x024d
PMM0612.upload_port.4.board=PMM0612
PMM0612.build.usb_product="PMM0612"
PMM0612.upload.tool=bossac
PMM0612.upload.tool.default=bossac
PMM0612.upload.tool.network=arduino_ota
PMM0612.upload.protocol=sam-ba
PMM0612.upload.maximum_size=262144
PMM0612.upload.maximum_data_size=32768
PMM0612.upload.use_1200bps_touch=true
PMM0612.upload.wait_for_upload_port=true
PMM0612.upload.native_usb=true
PMM0612.build.mcu=cortex-m0plus
PMM0612.build.f_cpu=48000000L
PMM0612.build.usb_product="PMM0612"
PMM0612.build.usb_manufacturer="PMM LLC"
PMM0612.build.board=PMM0612
PMM0612.build.core=arduino
PMM0612.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0612.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0612.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0612.build.variant=pmm062X
PMM0612.build.variant_system_lib=
PMM0612.build.vid=0x2341
PMM0612.build.pid=0x804d
PMM0612.bootloader.tool=openocd
PMM0612.bootloader.tool.default=openocd
PMM0612.bootloader.file=zero/samd21_sam_ba.bin

# PMM0640 (ESI 1PH Energy Meter)
# --------------------------------------
PMM0640.name=PMM0640 (ESI 1PH ENERGY METER)
PMM0640.vid.0=0x2341
PMM0640.pid.0=0x804d
PMM0640.vid.1=0x2341
PMM0640.pid.1=0x004d
PMM0640.vid.2=0x2341
PMM0640.pid.2=0x824d
PMM0640.vid.3=0x2341
PMM0640.pid.3=0x024d
PMM0640.upload_port.0.vid=0x2341
PMM0640.upload_port.0.pid=0x804d
PMM0640.upload_port.1.vid=0x2341
PMM0640.upload_port.1.pid=0x004d
PMM0640.upload_port.2.vid=0x2341
PMM0640.upload_port.2.pid=0x824d
PMM0640.upload_port.3.vid=0x2341
PMM0640.upload_port.3.pid=0x024d
PMM0640.upload_port.4.board=PMM0640
PMM0640.build.usb_product="PMM0640"
PMM0640.upload.tool=bossac
PMM0640.upload.tool.default=bossac
PMM0640.upload.tool.network=arduino_ota
PMM0640.upload.protocol=sam-ba
PMM0640.upload.maximum_size=262144
PMM0640.upload.maximum_data_size=32768
PMM0640.upload.use_1200bps_touch=true
PMM0640.upload.wait_for_upload_port=true
PMM0640.upload.native_usb=true
PMM0640.build.mcu=cortex-m0plus
PMM0640.build.f_cpu=48000000L
PMM0640.build.usb_product="pmm0640"
PMM0640.build.usb_manufacturer="PMM LLC"
PMM0640.build.board=pmm0640
PMM0640.build.core=arduino
PMM0640.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0640.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0640.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0640.build.variant=pmm062X
PMM0640.build.variant_system_lib=
PMM0640.build.vid=0x2341
PMM0640.build.pid=0x804d
PMM0640.bootloader.tool=openocd
PMM0640.bootloader.tool.default=openocd
PMM0640.bootloader.file=zero/samd21_sam_ba.bin

# PMM0641 (ESI 3PH Energy Meter)
# --------------------------------------
PMM0641.name=PMM0641 (ESI 3PH ENERGY METER)
PMM0641.vid.0=0x2341
PMM0641.pid.0=0x804d
PMM0641.vid.1=0x2341
PMM0641.pid.1=0x004d
PMM0641.vid.2=0x2341
PMM0641.pid.2=0x824d
PMM0641.vid.3=0x2341
PMM0641.pid.3=0x024d
PMM0641.upload_port.0.vid=0x2341
PMM0641.upload_port.0.pid=0x804d
PMM0641.upload_port.1.vid=0x2341
PMM0641.upload_port.1.pid=0x004d
PMM0641.upload_port.2.vid=0x2341
PMM0641.upload_port.2.pid=0x824d
PMM0641.upload_port.3.vid=0x2341
PMM0641.upload_port.3.pid=0x024d
PMM0641.upload_port.4.board=PMM0641
PMM0641.build.usb_product="PMM0641"
PMM0641.upload.tool=bossac
PMM0641.upload.tool.default=bossac
PMM0641.upload.tool.network=arduino_ota
PMM0641.upload.protocol=sam-ba
PMM0641.upload.maximum_size=262144
PMM0641.upload.maximum_data_size=32768
PMM0641.upload.use_1200bps_touch=true
PMM0641.upload.wait_for_upload_port=true
PMM0641.upload.native_usb=true
PMM0641.build.mcu=cortex-m0plus
PMM0641.build.f_cpu=48000000L
PMM0641.build.usb_product="pmm0641"
PMM0641.build.usb_manufacturer="PMM LLC"
PMM0641.build.board=pmm0640
PMM0641.build.core=arduino
PMM0641.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0641.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0641.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0641.build.variant=pmm062X
PMM0641.build.variant_system_lib=
PMM0641.build.vid=0x2341
PMM0641.build.pid=0x804d
PMM0641.bootloader.tool=openocd
PMM0641.bootloader.tool.default=openocd
PMM0641.bootloader.file=zero/samd21_sam_ba.bin

# PMM0650 (ESI Temperature and humidity Controller)
# --------------------------------------
PMM0650.name=PMM0650 (ESI PROCESS CONTROLLER)
PMM0650.vid.0=0x2341
PMM0650.pid.0=0x804d
PMM0650.vid.1=0x2341
PMM0650.pid.1=0x004d
PMM0650.vid.2=0x2341
PMM0650.pid.2=0x824d
PMM0650.vid.3=0x2341
PMM0650.pid.3=0x024d
PMM0650.upload_port.0.vid=0x2341
PMM0650.upload_port.0.pid=0x804d
PMM0650.upload_port.1.vid=0x2341
PMM0650.upload_port.1.pid=0x004d
PMM0650.upload_port.2.vid=0x2341
PMM0650.upload_port.2.pid=0x824d
PMM0650.upload_port.3.vid=0x2341
PMM0650.upload_port.3.pid=0x024d
PMM0650.upload_port.4.board=PMM0650
PMM0650.build.usb_product="PMM0650"
PMM0650.upload.tool=bossac
PMM0650.upload.tool.default=bossac
PMM0650.upload.tool.network=arduino_ota
PMM0650.upload.protocol=sam-ba
PMM0650.upload.maximum_size=262144
PMM0650.upload.maximum_data_size=32768
PMM0650.upload.use_1200bps_touch=true
PMM0650.upload.wait_for_upload_port=true
PMM0650.upload.native_usb=true
PMM0650.build.mcu=cortex-m0plus
PMM0650.build.f_cpu=48000000L
PMM0650.build.usb_product="pmm0650"
PMM0650.build.usb_manufacturer="PMM LLC"
PMM0650.build.board=pmm0650
PMM0650.build.core=arduino
PMM0650.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0650.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0650.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0650.build.variant=pmm062X
PMM0650.build.variant_system_lib=
PMM0650.build.vid=0x2341
PMM0650.build.pid=0x804d
PMM0650.bootloader.tool=openocd
PMM0650.bootloader.tool.default=openocd
PMM0650.bootloader.file=zero/samd21_sam_ba.bin


# PMM0675 (ESI 4x Basic Optical encoder interface)
# --------------------------------------
PMM0675.name=PMM0675 (ESI 4X OPTICAL ENCODER)
PMM0675.vid.0=0x2341
PMM0675.pid.0=0x804d
PMM0675.vid.1=0x2341
PMM0675.pid.1=0x004d
PMM0675.vid.2=0x2341
PMM0675.pid.2=0x824d
PMM0675.vid.3=0x2341
PMM0675.pid.3=0x024d
PMM0675.upload_port.0.vid=0x2341
PMM0675.upload_port.0.pid=0x804d
PMM0675.upload_port.1.vid=0x2341
PMM0675.upload_port.1.pid=0x004d
PMM0675.upload_port.2.vid=0x2341
PMM0675.upload_port.2.pid=0x824d
PMM0675.upload_port.3.vid=0x2341
PMM0675.upload_port.3.pid=0x024d
PMM0675.upload_port.4.board=PMM0675
PMM0675.build.usb_product="PMM0675"
PMM0675.upload.tool=bossac
PMM0675.upload.tool.default=bossac
PMM0675.upload.tool.network=arduino_ota
PMM0675.upload.protocol=sam-ba
PMM0675.upload.maximum_size=262144
PMM0675.upload.maximum_data_size=32768
PMM0675.upload.use_1200bps_touch=true
PMM0675.upload.wait_for_upload_port=true
PMM0675.upload.native_usb=true
PMM0675.build.mcu=cortex-m0plus
PMM0675.build.f_cpu=48000000L
PMM0675.build.usb_product="PMM0675"
PMM0675.build.usb_manufacturer="PMM LLC"
PMM0675.build.board=pmm0675
PMM0675.build.core=arduino
PMM0675.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0675.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0675.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0675.build.variant=pmm062X
PMM0675.build.variant_system_lib=
PMM0675.build.vid=0x2341
PMM0675.build.pid=0x804d
PMM0675.bootloader.tool=openocd
PMM0675.bootloader.tool.default=openocd
PMM0675.bootloader.file=zero/samd21_sam_ba.bin

# PMM0676 (ESI Advanced Optical encoder interface)
# --------------------------------------
PMM0676.name=PMM0676 (ESI ADV OPTICAL ENCODER)
PMM0676.vid.0=0x2341
PMM0676.pid.0=0x804d
PMM0676.vid.1=0x2341
PMM0676.pid.1=0x004d
PMM0676.vid.2=0x2341
PMM0676.pid.2=0x824d
PMM0676.vid.3=0x2341
PMM0676.pid.3=0x024d
PMM0676.upload_port.0.vid=0x2341
PMM0676.upload_port.0.pid=0x804d
PMM0676.upload_port.1.vid=0x2341
PMM0676.upload_port.1.pid=0x004d
PMM0676.upload_port.2.vid=0x2341
PMM0676.upload_port.2.pid=0x824d
PMM0676.upload_port.3.vid=0x2341
PMM0676.upload_port.3.pid=0x024d
PMM0676.upload_port.4.board=PMM0676
PMM0676.build.usb_product="PMM0676"
PMM0676.upload.tool=bossac
PMM0676.upload.tool.default=bossac
PMM0676.upload.tool.network=arduino_ota
PMM0676.upload.protocol=sam-ba
PMM0676.upload.maximum_size=262144
PMM0676.upload.maximum_data_size=32768
PMM0676.upload.use_1200bps_touch=true
PMM0676.upload.wait_for_upload_port=true
PMM0676.upload.native_usb=true
PMM0676.build.mcu=cortex-m0plus
PMM0676.build.f_cpu=48000000L
PMM0676.build.usb_product="pmm0676"
PMM0676.build.usb_manufacturer="PMM LLC"
PMM0676.build.board=pmm0676
PMM0676.build.core=arduino
PMM0676.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0676.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0676.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0676.build.variant=pmm062X
PMM0676.build.variant_system_lib=
PMM0676.build.vid=0x2341
PMM0676.build.pid=0x804d
PMM0676.bootloader.tool=openocd
PMM0676.bootloader.tool.default=openocd
PMM0676.bootloader.file=zero/samd21_sam_ba.bin


# pmm0680 (ESI Load Cell MODBUS TCP V2.2)
# --------------------------------------
pmm0680.name=PMM0680 (ESI LOADCELL INTERFACE)
pmm0680.vid.0=0x2341
pmm0680.pid.0=0x804d
pmm0680.vid.1=0x2341
pmm0680.pid.1=0x004d
pmm0680.vid.2=0x2341
pmm0680.pid.2=0x824d
pmm0680.vid.3=0x2341
pmm0680.pid.3=0x024d
pmm0680.upload_port.0.vid=0x2341
pmm0680.upload_port.0.pid=0x804d
pmm0680.upload_port.1.vid=0x2341
pmm0680.upload_port.1.pid=0x004d
pmm0680.upload_port.2.vid=0x2341
pmm0680.upload_port.2.pid=0x824d
pmm0680.upload_port.3.vid=0x2341
pmm0680.upload_port.3.pid=0x024d
pmm0680.upload_port.4.board=pmm0680
pmm0680.build.usb_product="pmm0680"
pmm0680.upload.tool=bossac
pmm0680.upload.tool.default=bossac
pmm0680.upload.tool.network=arduino_ota
pmm0680.upload.protocol=sam-ba
pmm0680.upload.maximum_size=262144
pmm0680.upload.maximum_data_size=32768
pmm0680.upload.use_1200bps_touch=true
pmm0680.upload.wait_for_upload_port=true
pmm0680.upload.native_usb=true
pmm0680.build.mcu=cortex-m0plus
pmm0680.build.f_cpu=48000000L
pmm0680.build.usb_product="pmm0680"
pmm0680.build.usb_manufacturer="PMM LLC"
pmm0680.build.board=pmm0680
pmm0680.build.core=arduino
pmm0680.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
pmm0680.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pmm0680.build.openocdscript=openocd_scripts/arduino_zero.cfg
pmm0680.build.variant=pmm062X
pmm0680.build.variant_system_lib=
pmm0680.build.vid=0x2341
pmm0680.build.pid=0x804d
pmm0680.bootloader.tool=openocd
pmm0680.bootloader.tool.default=openocd
pmm0680.bootloader.file=zero/samd21_sam_ba.bin

