Israr-Engineering/PMM/custom_Board/1.8.13/boards.txt
# PMM1102 (S GPS TO RS485 )
# --------------------------------------
PMM1102.name=PMM1102 (S GPS TO RS485 )
PMM1102.vid.0=0x2341
PMM1102.pid.0=0x804d
PMM1102.vid.1=0x2341
PMM1102.pid.1=0x004d
PMM1102.vid.2=0x2341
PMM1102.pid.2=0x824d
PMM1102.vid.3=0x2341
PMM1102.pid.3=0x024d
PMM1102.upload_port.0.vid=0x2341
PMM1102.upload_port.0.pid=0x804d
PMM1102.upload_port.1.vid=0x2341
PMM1102.upload_port.1.pid=0x004d
PMM1102.upload_port.2.vid=0x2341
PMM1102.upload_port.2.pid=0x824d
PMM1102.upload_port.3.vid=0x2341
PMM1102.upload_port.3.pid=0x024d
PMM1102.upload_port.4.board=PMM1102
PMM1102.build.usb_product="PMM1102"
PMM1102.upload.tool=bossac
PMM1102.upload.tool.default=bossac
PMM1102.upload.tool.network=arduino_ota
PMM1102.upload.protocol=sam-ba
PMM1102.upload.maximum_size=262144
PMM1102.upload.maximum_data_size=32768
PMM1102.upload.use_1200bps_touch=true
PMM1102.upload.wait_for_upload_port=true
PMM1102.upload.native_usb=true
PMM1102.build.mcu=cortex-m0plus
PMM1102.build.f_cpu=48000000L
PMM1102.build.usb_product="PMM1102"
PMM1102.build.usb_manufacturer="PMM LLC"
PMM1102.build.board=PMM1102
PMM1102.build.core=arduino
PMM1102.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1102.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1102.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1102.build.variant=pmm062X
PMM1102.build.variant_system_lib=
PMM1102.build.vid=0x2341
PMM1102.build.pid=0x804d
PMM1102.bootloader.tool=openocd
PMM1102.bootloader.tool.default=openocd
PMM1102.bootloader.file=zero/samd21_sam_ba.bin

